---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.WrongUserException
source: html/113eb364-5afe-e1e5-fb86-35c43af3718f.htm
---
# WrongUserException Methods

Retrieves data needed to serialize the target object.